app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" ASC LIMIT 1
---
  def index
    @articles = Article.all

SELECT "articles".* FROM "articles"
---
  def home
    @articles = Article.all

INSERT INTO "articles" ("title", "billboard", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Tomas"], ["billboard", "lala"], ["body", "asasas"], ["created_at", "2017-03-14 18:44:43.582084"], ["updated_at", "2017-03-14 18:44:43.582084"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = $1, "billboard" = $2, "body" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "0"], ["billboard", "0"], ["body", "0"], ["updated_at", "2017-03-15 04:45:26.672415"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)